In [1]:
import sqlalchemy as db
from sqlalchemy import text
import pandas as pd
from pandasql import sqldf

In [21]:
engine = db.create_engine("mysql://root:root@172.16.5.4:3310/retail_db")

In [22]:
conn = engine.connect()

In [42]:
order_items_df= pd.read_sql("SELECT * FROM order_items", con=conn)
order_items_df.head()

,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price
0,1,1,957,1,299.98,299.98
1,2,2,1073,1,199.99,199.99
2,3,2,502,5,250.00,50.00
3,4,2,403,1,129.99,129.99
4,5,4,897,2,49.98,24.99

In [39]:
categories_df = pd.read_sql("SELECT * FROM categories", con=conn)
categories_df.head()

   category_id  category_department_id        category_name
0            1                       2             Football
1            2                       2               Soccer
2            3                       2  Baseball & Softball
3            4                       2           Basketball
4            5                       2             Lacrosse

In [25]:
orders_df = pd.read_sql("SELECT * FROM orders", con=conn)
orders_df.head()

   order_id order_date  order_customer_id     order_status
0         1 2013-07-25              11599           CLOSED
1         2 2013-07-25                256  PENDING_PAYMENT
2         3 2013-07-25              12111         COMPLETE
3         4 2013-07-25               8827           CLOSED
4         5 2013-07-25              11318         COMPLETE

In [ ]:
customer_df = pd.read_sql("SELECT * FROM customers", con=conn)
customer_df.head()

In [26]:
departments_df = pd.read_sql("SELECT * FROM departments", con=conn)
departments_df.head()

   department_id department_name
0              2         Fitness
1              3        Footwear
2              4         Apparel
3              5            Golf
4              6        Outdoors

In [27]:
products_df = pd.read_sql("SELECT * FROM products", con=conn)
products_df.head()

,product_id,product_category_id,product_name,product_description,product_price,product_image
0,1,2,Quest Q64 10 FT. x 10 FT. Slant Leg Instant U,,59.98,http://images.acmesports.sports/Quest+Q64+10+F...
1,2,2,Under Armour Men's Highlight MC Football Clea,,129.99,http://images.acmesports.sports/Under+Armour+M...
2,3,2,Under Armour Men's Renegade D Mid Football Cl,,89.99,http://images.acmesports.sports/Under+Armour+M...
3,4,2,Under Armour Men's Renegade D Mid Football Cl,,89.99,http://images.acmesports.sports/Under+Armour+M...
4,5,2,Riddell Youth Revolution Speed Custom Footbal,,199.99,http://images.acmesports.sports/Riddell+Youth+...

In [30]:
# promedio de ingresos por dia
df_promedio = orders_df.merge(orders_items_df,left_on='order_id',right_on='order_item_order_id', how='left')
df_promedio.head()

,order_id,order_date,order_customer_id,order_status,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price
0,1,2013-07-25,11599,CLOSED,1.0,1.0,957.0,1.0,299.98,299.98
1,2,2013-07-25,256,PENDING_PAYMENT,2.0,2.0,1073.0,1.0,199.99,199.99
2,2,2013-07-25,256,PENDING_PAYMENT,3.0,2.0,502.0,5.0,250.00,50.00
3,2,2013-07-25,256,PENDING_PAYMENT,4.0,2.0,403.0,1.0,129.99,129.99
4,3,2013-07-25,12111,COMPLETE,NaN,NaN,NaN,NaN,NaN,NaN

In [34]:
# obtner el mes del promedio anterior 5:7 es la posicion en la fecha donde inicia el mes y termina crtl + d para seleccionar todos los campos igual que quiero cambiar
df_promedio['month'] = df_promedio['order_date'].astype(str).str[5:7]
df_promedio['month'] = df_promedio['month'].astype('int32')
df_promedio.head()

,order_id,order_date,order_customer_id,order_status,order_item_id,order_item_order_id,order_item_product_id,order_item_quantity,order_item_subtotal,order_item_product_price,month
0,1,2013-07-25,11599,CLOSED,1.0,1.0,957.0,1.0,299.98,299.98,7
1,2,2013-07-25,256,PENDING_PAYMENT,2.0,2.0,1073.0,1.0,199.99,199.99,7
2,2,2013-07-25,256,PENDING_PAYMENT,3.0,2.0,502.0,5.0,250.00,50.00,7
3,2,2013-07-25,256,PENDING_PAYMENT,4.0,2.0,403.0,1.0,129.99,129.99,7
4,3,2013-07-25,12111,COMPLETE,NaN,NaN,NaN,NaN,NaN,NaN,7

In [36]:
df_promedio_final = df_promedio[['order_date','order_item_subtotal']].groupby('order_date').sum()['order_item_subtotal']/df_promedio[['order_date','order_item_order_id']]\
.drop_duplicates().groupby('order_date').count()['order_item_order_id']
df_promedio_final

order_date
2013-07-25    587.533017
2013-07-26    585.923476
2013-07-27    577.567657
2013-07-28    551.411899
2013-07-29    635.588380
                 ...
2014-07-20    584.709917
2014-07-21    599.518663
2014-07-22    625.080000
2014-07-23    637.611449
2014-07-24    588.341455
Length: 364, dtype: float64

In [43]:
df_join  = orders_df.merge(order_items_df, left_on='order_id', right_on='order_item_order_id')\
                    .merge(products_df, left_on='order_item_product_id', right_on='product_id')\
                    .merge(categories_df, left_on='product_category_id', right_on='category_id')\
                    .merge(departments_df, left_on='category_department_id', right_on='department_id')

In [45]:
df_promedio = df_join[['department_name','order_item_subtotal']].groupby('department_name').sum()['order_item_subtotal']/df_join[['department_name','order_item_order_id']]\
                    .drop_duplicates().groupby('department_name').count()['order_item_order_id']
df_promedio.head()

department_name
Apparel     222.004311
Fan Shop    419.575364
Fitness     134.636606
Footwear    307.978997
Golf        178.030369
dtype: float64

In [49]:
df_promedio = df_join[['department_name','order_item_subtotal']].groupby('department_name').sum().sort_values(by=['order_item_subtotal'], ascending = False)
df_promedio.head()

                 order_item_subtotal
department_name
Fan Shop                 17107765.88
Apparel                   7323700.20
Golf                      4609028.22
Footwear                  4006498.77
Outdoors                   995582.72

In [6]:
! pip install mysqlclient==2.2.4

Collecting mysqlclient==2.2.4
  Downloading mysqlclient-2.2.4.tar.gz (90 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 90.4/90.4 kB 2.4 MB/s eta 0:00:00
  Installing build dependencies ... done
  Getting requirements to build wheel ... done
  Installing backend dependencies ... done
  Preparing metadata (pyproject.toml) ... done
Building wheels for collected packages: mysqlclient
  Building wheel for mysqlclient (pyproject.toml) ... done
  Created wheel for mysqlclient: filename=mysqlclient-2.2.4-cp310-cp310-linux_x86_64.whl size=132261 sha256=929e0562a641f0fe203518d8fae79260e548fdd7a4746647961e75f4e3ff364b
  Stored in directory: /home/codespace/.cache/pip/wheels/ac/96/ac/2a4d8cb58a4d95de1dffc3f8b0ea42e0e5b63ab97640edbda3
Successfully built mysqlclient
Installing collected packages: mysqlclient
Successfully installed mysqlclient-2.2.4

In [5]:
! pip install mysql-connector-python==8.3.0

Collecting mysql-connector-python==8.3.0
  Downloading mysql_connector_python-8.3.0-cp310-cp310-manylinux_2_17_x86_64.whl.metadata (2.0 kB)
Downloading mysql_connector_python-8.3.0-cp310-cp310-manylinux_2_17_x86_64.whl (21.5 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 21.5/21.5 MB 44.6 MB/s eta 0:00:00:00:0100:01
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-8.3.0

In [4]:
! pip install SQLAlchemy==2.0.29

Collecting SQLAlchemy==2.0.29
  Downloading SQLAlchemy-2.0.29-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.metadata (9.6 kB)
Requirement already satisfied: typing-extensions>=4.6.0 in /home/codespace/.local/lib/python3.10/site-packages (from SQLAlchemy==2.0.29) (4.10.0)
Collecting greenlet!=0.4.17 (from SQLAlchemy==2.0.29)
  Downloading greenlet-3.0.3-cp310-cp310-manylinux_2_24_x86_64.manylinux_2_28_x86_64.whl.metadata (3.8 kB)
Downloading SQLAlchemy-2.0.29-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (3.1 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3.1/3.1 MB 34.8 MB/s eta 0:00:0000:0100:01
Downloading greenlet-3.0.3-cp310-cp310-manylinux_2_24_x86_64.manylinux_2_28_x86_64.whl (616 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 616.0/616.0 kB 16.4 MB/s eta 0:00:0000:01
Installing collected packages: greenlet, SQLAlchemy
Successfully installed SQLAlchemy-2.0.29 greenlet-3.0.3